-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- 主機： 127.0.0.1
-- 產生時間： 2024-09-06 11:25:32
-- 伺服器版本： 8.4.0
-- PHP 版本： 8.1.25

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `coffee`
--

-- --------------------------------------------------------

--
-- 資料表結構 `product_list`
--

CREATE TABLE `product_list` (
  `p_id` int NOT NULL,
  `p_name` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL,
  `p_price` int NOT NULL,
  `p_discount` int NOT NULL,
  `p_type` varchar(255) NOT NULL,
  `p_country` varchar(10) NOT NULL,
  `p_breed` varchar(10) NOT NULL,
  `p_process` varchar(10) NOT NULL,
  `p_roast` varchar(10) NOT NULL,
  `p_sale` varchar(30) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `p_date` date NOT NULL,
  `p_stock` int NOT NULL,
  `p_sold` int NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- 傾印資料表的資料 `product_list`
--

INSERT INTO `product_list` (`p_id`, `p_name`, `p_price`, `p_discount`, `p_type`, `p_country`, `p_breed`, `p_process`, `p_roast`, `p_sale`, `p_date`, `p_stock`, `p_sold`) VALUES
(1, '瓜地馬拉 帝比卡 半水洗處理', 3370, 2696, '咖啡豆', '瓜地馬拉', '帝比卡', '半水洗處理', '深烘焙', '原價八折', '1995-03-14', 43, 67),
(2, '台灣 藝妓 水洗處理', 2480, 1984, '推薦送禮', '台灣', '藝妓', '水洗處理', '中烘焙', '原價八折', '1989-01-20', 54, 51),
(3, '巴拿馬 帝比卡 葡萄乾蜜處理', 2160, 1728, '咖啡豆', '巴拿馬', '帝比卡', '葡萄乾蜜處理', '中烘焙', '原價八折', '1987-08-13', 53, 99),
(4, '哥倫比亞 藝妓 葡萄乾蜜處理', 570, 456, '季節限定', '哥倫比亞', '藝妓', '葡萄乾蜜處理', '淺烘焙', '原價八折', '1989-04-28', 78, 42),
(5, '巴西 阿拉比卡 半日曬處理', 730, 584, '推薦送禮', '巴西', '阿拉比卡', '半日曬處理', '淺烘焙', '原價八折', '1998-12-01', 32, 92),
(6, '瓜地馬拉 卡杜拉 半日曬處理', 660, 528, '咖啡豆', '瓜地馬拉', '卡杜拉', '半日曬處理', '淺烘焙', '原價八折', '1991-09-22', 49, 51),
(7, '衣索比亞 帝比卡 半日曬處理', 3750, 3000, '咖啡豆', '衣索比亞', '帝比卡', '半日曬處理', '淺烘焙', '原價八折', '1997-01-06', 73, 92),
(8, '瓜地馬拉 卡杜拉 水洗處理', 3130, 2504, '推薦送禮', '瓜地馬拉', '卡杜拉', '水洗處理', '深烘焙', '原價八折', '1995-03-25', 87, 74),
(9, '哥斯大黎加 卡杜拉 葡萄乾蜜處理', 2960, 2368, '推薦送禮', '哥斯大黎加', '卡杜拉', '葡萄乾蜜處理', '中烘焙', '原價八折', '1989-04-04', 65, 94),
(10, '哥倫比亞 阿拉比卡 半水洗處理', 1190, 952, '推薦送禮', '哥倫比亞', '阿拉比卡', '半水洗處理', '深烘焙', '原價八折', '1989-08-22', 99, 98),
(11, '瓜地馬拉 藝妓 半日曬處理', 2680, 2680, '推薦送禮', '瓜地馬拉', '藝妓', '半日曬處理', '中烘焙', NULL, '1989-06-12', 59, 60),
(12, '瓜地馬拉 阿拉比卡 日曬處理', 3800, 3800, '咖啡豆', '瓜地馬拉', '阿拉比卡', '日曬處理', '中烘焙', NULL, '1989-07-14', 35, 49),
(13, '衣索比亞 阿拉比卡 半日曬處理', 800, 800, '季節限定', '衣索比亞', '阿拉比卡', '半日曬處理', '淺烘焙', NULL, '1989-02-13', 81, 93),
(14, '衣索比亞 帝比卡 半日曬處理', 2470, 2470, '季節限定', '衣索比亞', '帝比卡', '半日曬處理', '深烘焙', NULL, '1988-01-09', 45, 49),
(15, '衣索比亞 卡杜拉 水洗處理', 1220, 1220, '季節限定', '衣索比亞', '卡杜拉', '水洗處理', '深烘焙', NULL, '1995-07-06', 21, 40),
(16, '衣索比亞 藝妓 日曬處理', 3120, 3120, '季節限定', '衣索比亞', '藝妓', '日曬處理', '深烘焙', NULL, '1989-08-30', 90, 66),
(17, '肯亞 阿拉比卡 葡萄乾蜜處理', 3680, 3680, '推薦送禮', '肯亞', '阿拉比卡', '葡萄乾蜜處理', '中烘焙', NULL, '1994-02-26', 55, 49),
(18, '祕魯 卡杜拉 半水洗處理', 1320, 1320, '推薦送禮', '祕魯', '卡杜拉', '半水洗處理', '中烘焙', NULL, '1992-05-10', 97, 94),
(19, '瓜地馬拉 卡杜拉 日曬處理', 1830, 1830, '推薦送禮', '瓜地馬拉', '卡杜拉', '日曬處理', '深烘焙', NULL, '1997-06-04', 78, 42),
(20, '哥斯大黎加 藝妓 水洗處理', 1550, 1550, '季節限定', '哥斯大黎加', '藝妓', '水洗處理', '中烘焙', NULL, '1986-04-14', 72, 62),
(21, '巴拿馬 阿拉比卡 水洗處理', 1170, 1170, '咖啡豆', '巴拿馬', '阿拉比卡', '水洗處理', '中烘焙', NULL, '1998-06-02', 25, 41),
(22, '瓜地馬拉 藝妓 半水洗處理', 1790, 1790, '咖啡豆', '瓜地馬拉', '藝妓', '半水洗處理', '淺烘焙', NULL, '1997-03-18', 83, 44),
(23, '肯亞 阿拉比卡 日曬處理', 3870, 3870, '季節限定', '肯亞', '阿拉比卡', '日曬處理', '深烘焙', NULL, '1998-12-04', 65, 62),
(24, '衣索比亞 阿拉比卡 半水洗處理', 3390, 3390, '咖啡豆', '衣索比亞', '阿拉比卡', '半水洗處理', '淺烘焙', NULL, '1994-11-06', 45, 49),
(25, '瓜地馬拉 藝妓 日曬處理', 3280, 3280, '推薦送禮', '瓜地馬拉', '藝妓', '日曬處理', '淺烘焙', NULL, '1990-09-20', 79, 46),
(26, '哥斯大黎加 藝妓 日曬處理', 3400, 3400, '咖啡豆', '哥斯大黎加', '藝妓', '日曬處理', '中烘焙', NULL, '1996-02-02', 89, 46),
(27, '祕魯 帝比卡 半日曬處理', 3350, 3350, '咖啡豆', '祕魯', '帝比卡', '半日曬處理', '淺烘焙', NULL, '1999-08-23', 49, 89),
(28, '衣索比亞 藝妓 半日曬處理', 1130, 1130, '推薦送禮', '衣索比亞', '藝妓', '半日曬處理', '中烘焙', NULL, '1986-07-17', 37, 60),
(29, '巴西 阿拉比卡 半水洗處理', 2760, 2760, '咖啡豆', '巴西', '阿拉比卡', '半水洗處理', '中烘焙', NULL, '1993-09-24', 10, 65),
(30, '哥倫比亞 帝比卡 水洗處理', 2320, 2320, '推薦送禮', '哥倫比亞', '帝比卡', '水洗處理', '淺烘焙', NULL, '1999-01-08', 69, 73),
(31, '祕魯 帝比卡 半日曬處理', 660, 660, '季節限定', '祕魯', '帝比卡', '半日曬處理', '中烘焙', NULL, '1988-09-27', 81, 78),
(32, '衣索比亞 帝比卡 水洗處理', 2890, 2890, '推薦送禮', '衣索比亞', '帝比卡', '水洗處理', '深烘焙', NULL, '1989-06-28', 85, 85),
(33, '肯亞 帝比卡 水洗處理', 780, 780, '季節限定', '肯亞', '帝比卡', '水洗處理', '淺烘焙', NULL, '1991-04-06', 48, 57),
(34, '瓜地馬拉 帝比卡 半日曬處理', 3760, 3760, '推薦送禮', '瓜地馬拉', '帝比卡', '半日曬處理', '淺烘焙', NULL, '1997-12-11', 33, 64),
(35, '衣索比亞 帝比卡 日曬處理', 2350, 2350, '季節限定', '衣索比亞', '帝比卡', '日曬處理', '中烘焙', NULL, '1986-10-17', 40, 89),
(36, '巴拿馬 帝比卡 半日曬處理', 3680, 3680, '推薦送禮', '巴拿馬', '帝比卡', '半日曬處理', '淺烘焙', NULL, '1989-07-27', 17, 72),
(37, '台灣 卡杜拉 日曬處理', 1700, 1700, '季節限定', '台灣', '卡杜拉', '日曬處理', '中烘焙', NULL, '1991-12-22', 76, 100),
(38, '台灣 帝比卡 日曬處理', 2990, 2990, '咖啡豆', '台灣', '帝比卡', '日曬處理', '淺烘焙', NULL, '1987-07-03', 62, 100),
(39, '哥倫比亞 帝比卡 半日曬處理', 2880, 2880, '咖啡豆', '哥倫比亞', '帝比卡', '半日曬處理', '深烘焙', NULL, '1985-10-03', 37, 48),
(40, '瓜地馬拉 阿拉比卡 葡萄乾蜜處理', 1580, 1580, '季節限定', '瓜地馬拉', '阿拉比卡', '葡萄乾蜜處理', '淺烘焙', NULL, '1999-01-24', 86, 86),
(41, '衣索比亞 藝妓 葡萄乾蜜處理', 3260, 3260, '季節限定', '衣索比亞', '藝妓', '葡萄乾蜜處理', '淺烘焙', NULL, '1991-03-17', 74, 60),
(42, '台灣 阿拉比卡 半日曬處理', 2970, 2970, '推薦送禮', '台灣', '阿拉比卡', '半日曬處理', '深烘焙', NULL, '1985-05-12', 34, 74),
(43, '肯亞 帝比卡 葡萄乾蜜處理', 610, 610, '推薦送禮', '肯亞', '帝比卡', '葡萄乾蜜處理', '淺烘焙', NULL, '1988-11-14', 67, 64),
(44, '瓜地馬拉 卡杜拉 半日曬處理', 3370, 3370, '咖啡豆', '瓜地馬拉', '卡杜拉', '半日曬處理', '淺烘焙', NULL, '1986-10-02', 78, 52),
(45, '肯亞 卡杜拉 半日曬處理', 2380, 2380, '季節限定', '肯亞', '卡杜拉', '半日曬處理', '淺烘焙', NULL, '1991-06-04', 28, 69),
(46, '哥倫比亞 帝比卡 葡萄乾蜜處理', 3970, 3970, '推薦送禮', '哥倫比亞', '帝比卡', '葡萄乾蜜處理', '中烘焙', NULL, '1987-03-18', 83, 97),
(47, '台灣 卡杜拉 葡萄乾蜜處理', 840, 840, '季節限定', '台灣', '卡杜拉', '葡萄乾蜜處理', '深烘焙', NULL, '1988-09-20', 100, 52),
(48, '巴拿馬 卡杜拉 半水洗處理', 3990, 3990, '咖啡豆', '巴拿馬', '卡杜拉', '半水洗處理', '中烘焙', NULL, '1997-03-01', 62, 72),
(49, '巴西 卡杜拉 半日曬處理', 2650, 2650, '季節限定', '巴西', '卡杜拉', '半日曬處理', '中烘焙', NULL, '1992-08-10', 39, 99),
(50, '巴拿馬 阿拉比卡 半水洗處理', 1120, 1120, '季節限定', '巴拿馬', '阿拉比卡', '半水洗處理', '中烘焙', NULL, '1997-12-02', 93, 67),
(51, '台灣 帝比卡 半水洗處理', 1700, 1700, '季節限定', '台灣', '帝比卡', '半水洗處理', '深烘焙', NULL, '1996-05-14', 92, 45),
(52, '衣索比亞 帝比卡 葡萄乾蜜處理', 490, 490, '咖啡豆', '衣索比亞', '帝比卡', '葡萄乾蜜處理', '深烘焙', NULL, '1988-12-12', 86, 94),
(53, '巴拿馬 阿拉比卡 水洗處理', 1430, 1430, '咖啡豆', '巴拿馬', '阿拉比卡', '水洗處理', '深烘焙', NULL, '1993-01-18', 87, 56),
(54, '哥斯大黎加 阿拉比卡 日曬處理', 1590, 1590, '咖啡豆', '哥斯大黎加', '阿拉比卡', '日曬處理', '中烘焙', NULL, '1987-02-04', 33, 86),
(55, '巴拿馬 阿拉比卡 半水洗處理', 2130, 2130, '推薦送禮', '巴拿馬', '阿拉比卡', '半水洗處理', '深烘焙', NULL, '1988-05-04', 23, 76),
(56, '肯亞 阿拉比卡 日曬處理', 3850, 3850, '咖啡豆', '肯亞', '阿拉比卡', '日曬處理', '深烘焙', NULL, '1996-06-26', 23, 84),
(57, '瓜地馬拉 帝比卡 葡萄乾蜜處理', 1520, 1520, '季節限定', '瓜地馬拉', '帝比卡', '葡萄乾蜜處理', '深烘焙', NULL, '1998-01-12', 45, 77),
(58, '巴西 卡杜拉 水洗處理', 3930, 3930, '推薦送禮', '巴西', '卡杜拉', '水洗處理', '中烘焙', NULL, '1990-03-04', 38, 41),
(59, '哥斯大黎加 帝比卡 葡萄乾蜜處理', 3260, 3260, '季節限定', '哥斯大黎加', '帝比卡', '葡萄乾蜜處理', '深烘焙', NULL, '1990-10-01', 26, 97),
(60, '瓜地馬拉 阿拉比卡 日曬處理', 3370, 3370, '咖啡豆', '瓜地馬拉', '阿拉比卡', '日曬處理', '深烘焙', NULL, '1997-03-17', 20, 59),
(61, '祕魯 卡杜拉 半日曬處理', 1270, 1270, '推薦送禮', '祕魯', '卡杜拉', '半日曬處理', '深烘焙', NULL, '1997-09-24', 16, 46),
(62, '哥倫比亞 藝妓 半日曬處理', 3630, 3630, '季節限定', '哥倫比亞', '藝妓', '半日曬處理', '中烘焙', NULL, '1988-02-19', 89, 80),
(63, '瓜地馬拉 阿拉比卡 日曬處理', 3200, 3200, '季節限定', '瓜地馬拉', '阿拉比卡', '日曬處理', '中烘焙', NULL, '1995-08-24', 70, 47),
(64, '哥斯大黎加 藝妓 半水洗處理', 1860, 1860, '季節限定', '哥斯大黎加', '藝妓', '半水洗處理', '淺烘焙', NULL, '1992-02-23', 94, 55),
(65, '衣索比亞 藝妓 葡萄乾蜜處理', 3730, 3730, '季節限定', '衣索比亞', '藝妓', '葡萄乾蜜處理', '中烘焙', NULL, '1985-11-20', 60, 66),
(66, '哥倫比亞 阿拉比卡 半日曬處理', 1530, 1530, '推薦送禮', '哥倫比亞', '阿拉比卡', '半日曬處理', '中烘焙', NULL, '1998-04-08', 33, 72),
(67, '哥斯大黎加 藝妓 葡萄乾蜜處理', 3900, 3900, '季節限定', '哥斯大黎加', '藝妓', '葡萄乾蜜處理', '淺烘焙', NULL, '1995-12-05', 76, 87),
(68, '巴拿馬 卡杜拉 半日曬處理', 1310, 1310, '推薦送禮', '巴拿馬', '卡杜拉', '半日曬處理', '深烘焙', NULL, '1999-11-21', 97, 44),
(69, '哥倫比亞 帝比卡 半日曬處理', 3680, 3680, '推薦送禮', '哥倫比亞', '帝比卡', '半日曬處理', '中烘焙', NULL, '1990-08-30', 41, 80),
(70, '台灣 阿拉比卡 葡萄乾蜜處理', 1140, 1140, '季節限定', '台灣', '阿拉比卡', '葡萄乾蜜處理', '淺烘焙', NULL, '1987-12-26', 61, 67),
(71, '哥倫比亞 阿拉比卡 半水洗處理', 710, 710, '季節限定', '哥倫比亞', '阿拉比卡', '半水洗處理', '中烘焙', NULL, '1995-06-03', 52, 80),
(72, '巴西 阿拉比卡 半水洗處理', 2670, 2670, '季節限定', '巴西', '阿拉比卡', '半水洗處理', '深烘焙', NULL, '1987-11-04', 58, 89),
(73, '哥倫比亞 帝比卡 葡萄乾蜜處理', 1140, 1140, '季節限定', '哥倫比亞', '帝比卡', '葡萄乾蜜處理', '深烘焙', NULL, '1990-06-08', 47, 45),
(74, '台灣 阿拉比卡 葡萄乾蜜處理', 3420, 3420, '推薦送禮', '台灣', '阿拉比卡', '葡萄乾蜜處理', '淺烘焙', NULL, '1989-01-08', 51, 99),
(75, '瓜地馬拉 帝比卡 日曬處理', 3140, 3140, '季節限定', '瓜地馬拉', '帝比卡', '日曬處理', '中烘焙', NULL, '1997-07-13', 39, 44),
(76, '衣索比亞 帝比卡 水洗處理', 3730, 3730, '咖啡豆', '衣索比亞', '帝比卡', '水洗處理', '淺烘焙', NULL, '1986-01-14', 22, 44),
(77, '祕魯 藝妓 半日曬處理', 3080, 3080, '推薦送禮', '祕魯', '藝妓', '半日曬處理', '深烘焙', NULL, '1995-06-29', 86, 44),
(78, '巴拿馬 帝比卡 葡萄乾蜜處理', 2400, 2400, '季節限定', '巴拿馬', '帝比卡', '葡萄乾蜜處理', '中烘焙', NULL, '1996-12-18', 56, 73),
(79, '衣索比亞 帝比卡 水洗處理', 830, 830, '咖啡豆', '衣索比亞', '帝比卡', '水洗處理', '中烘焙', NULL, '1998-06-15', 78, 44),
(80, '哥倫比亞 帝比卡 水洗處理', 3970, 3970, '咖啡豆', '哥倫比亞', '帝比卡', '水洗處理', '深烘焙', NULL, '1998-04-06', 43, 73),
(81, '台灣 藝妓 水洗處理', 3760, 3760, '季節限定', '台灣', '藝妓', '水洗處理', '深烘焙', NULL, '1985-12-23', 35, 48),
(82, '瓜地馬拉 帝比卡 半日曬處理', 540, 540, '季節限定', '瓜地馬拉', '帝比卡', '半日曬處理', '淺烘焙', NULL, '1997-06-11', 78, 61),
(83, '肯亞 藝妓 水洗處理', 2150, 2150, '推薦送禮', '肯亞', '藝妓', '水洗處理', '深烘焙', NULL, '1990-01-15', 55, 54),
(84, '衣索比亞 卡杜拉 水洗處理', 1350, 1350, '推薦送禮', '衣索比亞', '卡杜拉', '水洗處理', '中烘焙', NULL, '1996-05-04', 54, 92),
(85, '哥斯大黎加 阿拉比卡 葡萄乾蜜處理', 3410, 3410, '季節限定', '哥斯大黎加', '阿拉比卡', '葡萄乾蜜處理', '淺烘焙', NULL, '1988-06-24', 32, 61),
(86, '巴西 帝比卡 半日曬處理', 490, 490, '季節限定', '巴西', '帝比卡', '半日曬處理', '深烘焙', NULL, '1997-08-11', 83, 74),
(87, '祕魯 藝妓 半水洗處理', 1970, 1970, '咖啡豆', '祕魯', '藝妓', '半水洗處理', '深烘焙', NULL, '1989-01-07', 16, 97),
(88, '巴拿馬 帝比卡 葡萄乾蜜處理', 2580, 2580, '季節限定', '巴拿馬', '帝比卡', '葡萄乾蜜處理', '中烘焙', NULL, '1998-03-14', 23, 96),
(89, '衣索比亞 阿拉比卡 半水洗處理', 2700, 2700, '推薦送禮', '衣索比亞', '阿拉比卡', '半水洗處理', '淺烘焙', NULL, '1993-03-23', 62, 77),
(90, '衣索比亞 藝妓 日曬處理', 1310, 1310, '咖啡豆', '衣索比亞', '藝妓', '日曬處理', '中烘焙', NULL, '1995-05-13', 23, 58),
(91, '台灣 阿拉比卡 水洗處理', 1860, 1860, '推薦送禮', '台灣', '阿拉比卡', '水洗處理', '中烘焙', NULL, '1993-03-08', 26, 42),
(92, '巴拿馬 卡杜拉 日曬處理', 900, 900, '季節限定', '巴拿馬', '卡杜拉', '日曬處理', '中烘焙', NULL, '1992-10-07', 56, 62),
(93, '哥斯大黎加 藝妓 半水洗處理', 910, 910, '咖啡豆', '哥斯大黎加', '藝妓', '半水洗處理', '淺烘焙', NULL, '1985-07-12', 29, 65),
(94, '巴拿馬 帝比卡 日曬處理', 2560, 2560, '咖啡豆', '巴拿馬', '帝比卡', '日曬處理', '深烘焙', NULL, '1988-10-10', 10, 89),
(95, '台灣 藝妓 葡萄乾蜜處理', 1100, 1100, '推薦送禮', '台灣', '藝妓', '葡萄乾蜜處理', '中烘焙', NULL, '1989-10-02', 92, 84),
(96, '肯亞 阿拉比卡 日曬處理', 2200, 2200, '推薦送禮', '肯亞', '阿拉比卡', '日曬處理', '淺烘焙', NULL, '1997-12-02', 90, 73),
(97, '哥倫比亞 藝妓 葡萄乾蜜處理', 3770, 3770, '季節限定', '哥倫比亞', '藝妓', '葡萄乾蜜處理', '中烘焙', NULL, '1989-06-02', 82, 69),
(98, '瓜地馬拉 藝妓 葡萄乾蜜處理', 1150, 1150, '推薦送禮', '瓜地馬拉', '藝妓', '葡萄乾蜜處理', '中烘焙', NULL, '1993-12-16', 18, 57),
(99, '巴拿馬 藝妓 日曬處理', 1160, 1160, '咖啡豆', '巴拿馬', '藝妓', '日曬處理', '淺烘焙', NULL, '1986-11-20', 76, 51),
(100, '衣索比亞 帝比卡 半日曬處理', 3720, 3720, '季節限定', '衣索比亞', '帝比卡', '半日曬處理', '淺烘焙', NULL, '1990-12-31', 37, 75),
(101, '哥倫比亞 藝妓 半日曬處理', 1980, 1980, '季節限定', '哥倫比亞', '藝妓', '半日曬處理', '中烘焙', NULL, '1998-02-18', 52, 54),
(102, '瓜地馬拉 帝比卡 半日曬處理', 510, 510, '咖啡豆', '瓜地馬拉', '帝比卡', '半日曬處理', '中烘焙', NULL, '1987-03-14', 25, 98),
(103, '瓜地馬拉 阿拉比卡 葡萄乾蜜處理', 3500, 3500, '咖啡豆', '瓜地馬拉', '阿拉比卡', '葡萄乾蜜處理', '淺烘焙', NULL, '1997-09-04', 34, 76),
(104, '瓜地馬拉 藝妓 葡萄乾蜜處理', 1980, 1980, '咖啡豆', '瓜地馬拉', '藝妓', '葡萄乾蜜處理', '淺烘焙', NULL, '1987-02-25', 74, 54),
(105, '祕魯 藝妓 水洗處理', 1550, 1550, '推薦送禮', '祕魯', '藝妓', '水洗處理', '中烘焙', NULL, '1998-10-14', 24, 46),
(106, '台灣 藝妓 水洗處理', 580, 580, '推薦送禮', '台灣', '藝妓', '水洗處理', '淺烘焙', NULL, '1991-05-18', 69, 81),
(107, '衣索比亞 帝比卡 半日曬處理', 3160, 3160, '季節限定', '衣索比亞', '帝比卡', '半日曬處理', '中烘焙', NULL, '1986-09-19', 85, 57),
(108, '巴西 卡杜拉 葡萄乾蜜處理', 2230, 2230, '季節限定', '巴西', '卡杜拉', '葡萄乾蜜處理', '深烘焙', NULL, '1991-08-07', 49, 73),
(109, '哥倫比亞 藝妓 日曬處理', 3370, 3370, '季節限定', '哥倫比亞', '藝妓', '日曬處理', '深烘焙', NULL, '1985-02-03', 13, 75),
(110, '哥倫比亞 帝比卡 日曬處理', 670, 670, '推薦送禮', '哥倫比亞', '帝比卡', '日曬處理', '淺烘焙', NULL, '1986-06-14', 48, 52),
(111, '衣索比亞 阿拉比卡 葡萄乾蜜處理', 1900, 1900, '推薦送禮', '衣索比亞', '阿拉比卡', '葡萄乾蜜處理', '中烘焙', NULL, '1996-10-31', 53, 96),
(112, '哥倫比亞 帝比卡 日曬處理', 860, 860, '季節限定', '哥倫比亞', '帝比卡', '日曬處理', '淺烘焙', NULL, '1991-06-05', 17, 78),
(113, '巴西 藝妓 半水洗處理', 650, 650, '季節限定', '巴西', '藝妓', '半水洗處理', '淺烘焙', NULL, '1992-05-07', 42, 57),
(114, '瓜地馬拉 帝比卡 半日曬處理', 1950, 1950, '咖啡豆', '瓜地馬拉', '帝比卡', '半日曬處理', '淺烘焙', NULL, '1989-11-15', 92, 98),
(115, '巴西 卡杜拉 日曬處理', 3470, 3470, '咖啡豆', '巴西', '卡杜拉', '日曬處理', '中烘焙', NULL, '1995-05-01', 53, 49),
(116, '瓜地馬拉 藝妓 半水洗處理', 1310, 1310, '咖啡豆', '瓜地馬拉', '藝妓', '半水洗處理', '淺烘焙', NULL, '1990-10-23', 24, 96),
(117, '肯亞 阿拉比卡 半日曬處理', 1310, 1310, '推薦送禮', '肯亞', '阿拉比卡', '半日曬處理', '中烘焙', NULL, '1986-06-22', 34, 46),
(118, '台灣 卡杜拉 半水洗處理', 3690, 3690, '季節限定', '台灣', '卡杜拉', '半水洗處理', '中烘焙', NULL, '1986-04-05', 46, 60),
(119, '巴西 藝妓 半日曬處理', 470, 470, '季節限定', '巴西', '藝妓', '半日曬處理', '中烘焙', NULL, '1985-05-09', 91, 56),
(120, '台灣 藝妓 葡萄乾蜜處理', 2540, 2540, '季節限定', '台灣', '藝妓', '葡萄乾蜜處理', '深烘焙', NULL, '1996-10-15', 68, 53),
(121, '巴西 帝比卡 日曬處理', 2500, 2500, '咖啡豆', '巴西', '帝比卡', '日曬處理', '淺烘焙', NULL, '1990-09-25', 47, 80),
(122, '巴拿馬 卡杜拉 水洗處理', 2150, 2150, '咖啡豆', '巴拿馬', '卡杜拉', '水洗處理', '中烘焙', NULL, '1992-11-27', 25, 48),
(123, '台灣 帝比卡 葡萄乾蜜處理', 1890, 1890, '咖啡豆', '台灣', '帝比卡', '葡萄乾蜜處理', '中烘焙', NULL, '1986-09-24', 75, 87),
(124, '台灣 帝比卡 半水洗處理', 760, 760, '咖啡豆', '台灣', '帝比卡', '半水洗處理', '淺烘焙', NULL, '1996-09-22', 47, 50),
(125, '巴西 卡杜拉 水洗處理', 3130, 3130, '咖啡豆', '巴西', '卡杜拉', '水洗處理', '深烘焙', NULL, '1998-10-15', 63, 97),
(126, '台灣 帝比卡 半水洗處理', 3380, 3380, '咖啡豆', '台灣', '帝比卡', '半水洗處理', '中烘焙', NULL, '1991-08-03', 20, 46),
(127, '台灣 帝比卡 日曬處理', 3840, 3840, '咖啡豆', '台灣', '帝比卡', '日曬處理', '淺烘焙', NULL, '1985-02-08', 91, 75),
(128, '哥倫比亞 卡杜拉 半日曬處理', 1360, 1360, '推薦送禮', '哥倫比亞', '卡杜拉', '半日曬處理', '中烘焙', NULL, '1988-10-14', 60, 82),
(129, '祕魯 卡杜拉 葡萄乾蜜處理', 2280, 2280, '季節限定', '祕魯', '卡杜拉', '葡萄乾蜜處理', '深烘焙', NULL, '1995-01-13', 29, 50),
(130, '巴拿馬 帝比卡 葡萄乾蜜處理', 2540, 2540, '咖啡豆', '巴拿馬', '帝比卡', '葡萄乾蜜處理', '中烘焙', NULL, '1997-07-20', 35, 41),
(131, '祕魯 帝比卡 葡萄乾蜜處理', 780, 780, '推薦送禮', '祕魯', '帝比卡', '葡萄乾蜜處理', '深烘焙', NULL, '1990-12-22', 92, 66),
(132, '祕魯 卡杜拉 日曬處理', 2160, 2160, '季節限定', '祕魯', '卡杜拉', '日曬處理', '深烘焙', NULL, '1985-04-27', 58, 89),
(133, '瓜地馬拉 阿拉比卡 半水洗處理', 2850, 2850, '季節限定', '瓜地馬拉', '阿拉比卡', '半水洗處理', '深烘焙', NULL, '1987-04-25', 77, 41),
(134, '哥倫比亞 卡杜拉 半水洗處理', 830, 830, '季節限定', '哥倫比亞', '卡杜拉', '半水洗處理', '深烘焙', NULL, '1993-08-17', 20, 45),
(135, '祕魯 藝妓 葡萄乾蜜處理', 750, 750, '季節限定', '祕魯', '藝妓', '葡萄乾蜜處理', '中烘焙', NULL, '1997-06-14', 64, 43),
(136, '肯亞 阿拉比卡 葡萄乾蜜處理', 1710, 1710, '季節限定', '肯亞', '阿拉比卡', '葡萄乾蜜處理', '淺烘焙', NULL, '1995-07-16', 96, 45),
(137, '巴拿馬 阿拉比卡 葡萄乾蜜處理', 3210, 3210, '季節限定', '巴拿馬', '阿拉比卡', '葡萄乾蜜處理', '中烘焙', NULL, '1988-12-19', 38, 85),
(138, '瓜地馬拉 卡杜拉 日曬處理', 1390, 1390, '咖啡豆', '瓜地馬拉', '卡杜拉', '日曬處理', '淺烘焙', NULL, '1991-08-15', 52, 54),
(139, '哥斯大黎加 帝比卡 水洗處理', 3750, 3750, '推薦送禮', '哥斯大黎加', '帝比卡', '水洗處理', '淺烘焙', NULL, '1994-03-18', 37, 50),
(140, '瓜地馬拉 卡杜拉 日曬處理', 610, 610, '推薦送禮', '瓜地馬拉', '卡杜拉', '日曬處理', '深烘焙', NULL, '1994-10-29', 13, 88),
(141, '瓜地馬拉 阿拉比卡 水洗處理', 2350, 2350, '咖啡豆', '瓜地馬拉', '阿拉比卡', '水洗處理', '中烘焙', NULL, '1988-05-28', 38, 70),
(142, '哥倫比亞 卡杜拉 葡萄乾蜜處理', 3910, 3910, '推薦送禮', '哥倫比亞', '卡杜拉', '葡萄乾蜜處理', '淺烘焙', NULL, '1987-07-24', 89, 81),
(143, '哥斯大黎加 阿拉比卡 日曬處理', 1070, 1070, '咖啡豆', '哥斯大黎加', '阿拉比卡', '日曬處理', '深烘焙', NULL, '1990-10-22', 15, 59),
(144, '巴西 卡杜拉 日曬處理', 2630, 2630, '季節限定', '巴西', '卡杜拉', '日曬處理', '淺烘焙', NULL, '1990-01-06', 94, 41),
(145, '巴拿馬 帝比卡 葡萄乾蜜處理', 710, 710, '推薦送禮', '巴拿馬', '帝比卡', '葡萄乾蜜處理', '中烘焙', NULL, '1997-04-17', 26, 90),
(146, '哥斯大黎加 卡杜拉 日曬處理', 960, 960, '推薦送禮', '哥斯大黎加', '卡杜拉', '日曬處理', '深烘焙', NULL, '1999-06-13', 66, 73),
(147, '哥斯大黎加 卡杜拉 半日曬處理', 3740, 3740, '季節限定', '哥斯大黎加', '卡杜拉', '半日曬處理', '淺烘焙', NULL, '1988-10-17', 42, 70),
(148, '台灣 阿拉比卡 半日曬處理', 1990, 1990, '季節限定', '台灣', '阿拉比卡', '半日曬處理', '深烘焙', NULL, '1986-08-05', 10, 53),
(149, '衣索比亞 帝比卡 半水洗處理', 2340, 2340, '季節限定', '衣索比亞', '帝比卡', '半水洗處理', '中烘焙', NULL, '1992-07-28', 29, 46),
(150, '哥倫比亞 卡杜拉 日曬處理', 3460, 3460, '季節限定', '哥倫比亞', '卡杜拉', '日曬處理', '中烘焙', NULL, '1993-09-02', 30, 51);

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `product_list`
--
ALTER TABLE `product_list`
  ADD PRIMARY KEY (`p_id`);

--
-- 在傾印的資料表使用自動遞增(AUTO_INCREMENT)
--

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `product_list`
--
ALTER TABLE `product_list`
  MODIFY `p_id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=151;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
